app/views/posts/_pv.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% @ids.each do |ids| %>
            <li><%= link_to Post.find(ids.to_i).title, post_path(ids.to_i) %><span> (<%= (REDIS.zscore "post", ids).to_i %>PV) </span></li>