app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts=Post.all
    if Post.all.count > 2

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts"
---
  def show
    @post=Post.find(params[:id])
    REDIS.zincrby "post", 1, @post.id
    if Post.all.count > 2

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "asdds"], ["content", "asdfdsads"], ["updated_at", "2020-04-08 03:19:56.443774"], ["id", 14]]
---
  def update
    if Post.find(params[:id]).update_attributes(post_params)

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["content", "aaaaa"], ["user_id", 1], ["created_at", "2020-04-06 11:36:35.109971"], ["updated_at", "2020-04-06 11:36:35.109971"]]
---
  def create
    @post=current_user.posts.new(post_params)
    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    Post.find(params[:id]).destroy